{"_path":"/blog/2015-02-28-starting-again","_dir":"blog","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"Starting Again, Without WordPress","description":"I've tried blogging for years. I wrote my first blog in ColdFusion in 2002, rewrote crude versions in PHP a few times before Matt dropped Wordpress on us at the local Blogger meetups, started extended writing habits on various web services and open source platforms from MovableType and Textpattern to LiveJornal and Tumblr.","headline":"Starting Again, Without WordPress","date":"2015-02-28T00:00:00.000Z","tags":"wordpress, jekyll, development, featured","body":{"type":"root","children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I've tried blogging for years. I wrote my first blog in ColdFusion in 2002, rewrote crude versions in PHP a few times before Matt dropped Wordpress on us at the local Blogger meetups, started extended writing habits on various web services and open source platforms from MovableType and Textpattern to LiveJornal and Tumblr."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This time around, I'm trying "},{"type":"element","tag":"a","props":{"href":"http://jekyllrb.com/","rel":["noopener","noreferer"],"target":"_blank"},"children":[{"type":"text","value":"Jekyll"}]},{"type":"text","value":". If you know me, I live and breath WordPress daily, so a Ruby-based static site generator might seem like a pretty odd choice. But in the end, it provides dead simple content management while retaining direct control over the guts of the site."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"I don't mean this as criticism of WordPress. It's an amazing example of the "},{"type":"element","tag":"a","props":{"href":"http://en.wikipedia.org/wiki/Pareto_principle","rel":["noopener","noreferer"],"target":"_blank"},"children":[{"type":"text","value":"80/20 rule"}]},{"type":"text","value":", covering the needs of the vast majority of web publishing scenarios. "},{"type":"element","tag":"a","props":{"href":"http://www.uptrending.com/","rel":["noopener","noreferer"],"target":"_blank"},"children":[{"type":"text","value":"Where I work"}]},{"type":"text","value":", we push that 80% hard, outfiting WordPress with modern interfaces and superpowers like marketing automation, user generated content, and API integrations."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"WordPress's intended user base is non-developer marketing staff and it excels at providing a powerful, flexible interface that serves that audience. For this site, though, I want to be able to control my code, repurposing a page at a whim. But I still enjoy having total control over the code and hate managing databases when I don't have to."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Enter Jekyll: it's lightweight, dependent only on my local system for build and it's hosted simply on Github. I can write my posts and pages in markdown or HTML and I don't have to worry about URL management, page creation, templating, etc."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Honestly, it also keeps me from getting lost in writing huge custom features and never finishing them. The static nature of Jekyll is a major shift in perspective from the realtime, dynamic webapp world I'm used to. I think that challenge to the status quo is a big asset."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Its easy to get lost in the tool you use most. WordPress, Rails, Laravel, Node, Angular, it doesn't matter. There's usually an opinion of a \"best\" platform, but truthfully none of them fit every scenario and some are better suited to others."}]},{"type":"element","tag":"blockquote","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"When all you have is a hammer, everything looks like a nail."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Just like this site, sometimes Wordpress isn't the best fit. If I don't try new options, I'd never know. So, this is my forray into production usage of a static site generator. Perhaps I'll get frustrated by the confines of runtime generation, or, maybe coloring in the lines is another way of defining the canvas. For now, I'm enjoying the flexiblity of a static site without all the fuss of manually managing site assets and layout changes. And when I do recommend WordPress, I'll be confident that it's the right tool for the job."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[]}},"_type":"markdown","_id":"content:blog:2015-02-28-starting-again.md","_source":"content","_file":"blog/2015-02-28-starting-again.md","_extension":"md"}